{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "6326fe33",
   "metadata": {},
   "source": [
    "# Importing libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "id": "521ba013",
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j\n",
    "import psycopg2\n",
    "import csv\n",
    "import math\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import os\n",
    "import sys\n",
    "from operator import itemgetter\n",
    "import helper_functions\n",
    "from helper_functions import postgress_helper\n",
    "from helper_functions import neo4j_helper\n",
    "from IPython.display import display"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fc92de2c",
   "metadata": {},
   "source": [
    "# Adding custom package path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 190,
   "id": "b4b40d53",
   "metadata": {},
   "outputs": [],
   "source": [
    "from os.path import dirname\n",
    "sys.path.append(dirname(os.getcwd() + '/helper_functions'))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f7803685",
   "metadata": {},
   "source": [
    "# Instantiating helper classes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "id": "828635c0",
   "metadata": {},
   "outputs": [],
   "source": [
    "pg_helper = postgress_helper.postgress_helper(db_name = \"northwinds_db\")\n",
    "n4j_helper = neo4j_helper.neo4j_helper(userid = \"neo4j\", password = \"w205\", db_name = \"neo4j\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "706daeee",
   "metadata": {},
   "source": [
    "# Wiping out databases in neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "id": "e9b702b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 0\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "n4j_helper.neo4j_wipe_out_database()\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "361775b6",
   "metadata": {},
   "source": [
    "# Creating cutomers nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "id": "eab38394",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 89\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT     cust.*\n",
    "         , ord.total_orders\n",
    "FROM       customers cust\n",
    "INNER JOIN (SELECT customer_id\n",
    "                 , COUNT(order_id) AS total_orders \n",
    "            FROM   orders\n",
    "            GROUP BY customer_id) ord\n",
    "ON         cust.customer_id = ord.customer_id\n",
    ";\n",
    "\"\"\"\n",
    "customer_df = pg_helper.select_query_pandas(query)\n",
    "for cust in customer_df.values.tolist():\n",
    "    cust_id, cust_name = 'cust_' + cust[0], cust[1]\n",
    "    total_orders = cust[-1]\n",
    "    label_name    = 'customer'\n",
    "    label_value   = cust_id\n",
    "    label_details = f\"{label_value}:{label_name}\"\n",
    "    node_property_string = '{customer_id: \"' + cust_id + '\", customer_name: \"' + cust_name + '\", total_orders: ' + str(total_orders) + '}'\n",
    "    n4j_helper.neo4j_create_node(label_details   = label_details\n",
    "                               , node_property   = node_property_string)\n",
    "n4j_helper.neo4j_number_nodes_relationships()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ea2f54e0",
   "metadata": {},
   "source": [
    "# Creating suppliers nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 194,
   "id": "de09b1b7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 118\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT *\n",
    "FROM   suppliers\n",
    ";\n",
    "\"\"\"\n",
    "supplier_df = pg_helper.select_query_pandas(query)\n",
    "for suppl in supplier_df.values.tolist():\n",
    "    supplier_id, supplier_name = 'suppl_' + str(suppl[0]), suppl[1]\n",
    "    label_name    = 'supplier'\n",
    "    label_value   = supplier_id\n",
    "    label_details = f\"{label_value}:{label_name}\"\n",
    "    node_property_string = '{supplier_id: \"' + supplier_id + '\", customer_name: \"' + supplier_name + '\"}'\n",
    "    n4j_helper.neo4j_create_node(label_details   = label_details\n",
    "                               , node_property   = node_property_string)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c72d9703",
   "metadata": {},
   "source": [
    "# Creating categories nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "36db370b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 126\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT *\n",
    "FROM   categories\n",
    ";\n",
    "\"\"\"\n",
    "ctg_df = pg_helper.select_query_pandas(query)\n",
    "for ctg in ctg_df.values.tolist():\n",
    "    ctg_id = 'ctg_' + str(ctg[0])\n",
    "    ctg_name = ctg[1]\n",
    "    label_name    = 'ctg'\n",
    "    label_value   = ctg_id\n",
    "    label_details = f\"{label_value}:{label_name}\"\n",
    "    node_property_string = '{ctg_id: \"' + ctg_id + '\", ctg_name: \"' + ctg_name + '\"}'\n",
    "    n4j_helper.neo4j_create_node(label_details   = label_details\n",
    "                               , node_property   = node_property_string)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "965c9be7",
   "metadata": {},
   "source": [
    "# Creating products nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 196,
   "id": "fe6f2d34",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 193\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT *\n",
    "FROM   products\n",
    "WHERE  discontinued = 0\n",
    ";\n",
    "\"\"\"\n",
    "prod_df = pg_helper.select_query_pandas(query)\n",
    "for prod in prod_df.values.tolist():\n",
    "    prod_id = 'prod_' + str(prod[0])\n",
    "    prod_name = prod[1]\n",
    "    supplier_id = 'suppl_' + str(prod[2])\n",
    "    ctg_id =  'ctg_' + str(prod[3])\n",
    "    label_name    = 'product'\n",
    "    label_value   = prod_id\n",
    "    label_details = f\"{label_value}:{label_name}\"\n",
    "    node_property_string = '{prod_id: \"' + prod_id + '\", prod_name: \"' + prod_name + '\", supplier_id: \"' + supplier_id + '\", ctg_id: \"' + ctg_id + '\"}'\n",
    "    n4j_helper.neo4j_create_node(label_details   = label_details\n",
    "                               , node_property   = node_property_string)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d992764f",
   "metadata": {},
   "source": [
    "# Creating orders nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 197,
   "id": "532b4c05",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 1023\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT *\n",
    "FROM   orders\n",
    ";\n",
    "\"\"\"\n",
    "order_header_df = pg_helper.select_query_pandas(query)\n",
    "for ord_hdr in order_header_df.values.tolist():\n",
    "    order_id = 'ord_' + str(ord_hdr[0])\n",
    "    customer_id = 'cust_' + ord_hdr[1]\n",
    "    label_name    = 'order_header'\n",
    "    label_value   = order_id\n",
    "    label_details = f\"{label_value}:{label_name}\"\n",
    "    node_property_string = '{order_id :\"' + order_id + '\", customer_id: \"' + customer_id + '\"}'\n",
    "    n4j_helper.neo4j_create_node(label_details = label_details\n",
    "                               , node_property = node_property_string)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f5cfd939",
   "metadata": {},
   "source": [
    "# Creating order details nodes and customer product relationship thru rating"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 198,
   "id": "b99b4736",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3178\n",
      "  Relationships: 1455\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT     ord_dtl.*\n",
    "         , dtl_agg.total_products_purchased\n",
    "         , ord_hdr.customer_id\n",
    "         , cust_agg.total_orders\n",
    "         , cust_tot_ord_qty.total_purchased\n",
    "FROM       order_details ord_dtl\n",
    "INNER JOIN orders        ord_hdr\n",
    "ON         ord_hdr.order_id = ord_dtl.order_id\n",
    "INNER JOIN customers cust\n",
    "ON         ord_hdr.customer_id = cust.customer_id\n",
    "INNER JOIN (SELECT customer_id\n",
    "                 , COUNT(order_id) AS total_orders \n",
    "            FROM   orders\n",
    "            GROUP BY customer_id\n",
    "           ) cust_agg\n",
    "ON         cust_agg.customer_id = ord_hdr.customer_id\n",
    "INNER JOIN (SELECT     cust.customer_id\n",
    "                     , dtl.product_id\n",
    "                     , SUM(dtl.quantity) AS total_products_purchased\n",
    "            FROM       customers     cust\n",
    "            INNER JOIN orders        hdr\n",
    "            ON         cust.customer_id = hdr.customer_id\n",
    "            INNER JOIN order_details dtl\n",
    "            ON         hdr.order_id = dtl.order_id\n",
    "            GROUP BY   cust.customer_id\n",
    "                     , dtl.product_id\n",
    "           ) dtl_agg\n",
    "ON         dtl_agg.customer_id = cust.customer_id\n",
    "AND        dtl_agg.product_id  = ord_dtl.product_id\n",
    "INNER JOIN (SELECT     cust.customer_id\n",
    "                     , SUM(dtl.quantity) AS total_purchased\n",
    "            FROM       customers     cust\n",
    "            INNER JOIN orders        hdr\n",
    "            ON         cust.customer_id = hdr.customer_id\n",
    "            INNER JOIN order_details dtl\n",
    "            ON         hdr.order_id = dtl.order_id\n",
    "            GROUP BY   cust.customer_id\n",
    "           ) cust_tot_ord_qty\n",
    "ON         cust_tot_ord_qty.customer_id = cust.customer_id\n",
    ";\n",
    "\"\"\"\n",
    "order_line_df = pg_helper.select_query_pandas(query)\n",
    "order_line_df['rating'] = order_line_df['total_products_purchased'] / order_line_df['total_purchased']\n",
    "for ord_line in order_line_df.values.tolist():\n",
    "    order_id = 'ord_' + str(ord_line[0])\n",
    "    prod_id = 'prod_' + str(ord_line[1])\n",
    "    ord_qty = ord_line[3]\n",
    "    \n",
    "    total_products_purchased = ord_line[-5]\n",
    "    customer_id = 'cust_' + ord_line[-4]\n",
    "    total_orders = ord_line[-3]\n",
    "    total_purchased = ord_line[-2]\n",
    "    rating = ord_line[-1]\n",
    "    \n",
    "    label_name    = 'order_line'\n",
    "    label_value   = order_id\n",
    "    label_details = f\"{label_value}:{label_name}\"\n",
    "    misc_str = f\", customer_id: '{customer_id}', total_orders: {total_orders}, total_products_purchased: {total_products_purchased}, total_purchased: {total_purchased}, rating: {rating}\"\n",
    "    node_property_string = '{order_id :\"' + order_id + '\", prod_id: \"' + prod_id + '\", qty: ' + str(ord_qty) + misc_str + \"}\"\n",
    "    n4j_helper.neo4j_create_node(label_details = label_details\n",
    "                               , node_property = node_property_string)\n",
    "    \n",
    "    rating_string = \"{\" + f\"rating : {rating}\" + \"}\"\n",
    "    search_string = f\" AND c.customer_id = '{customer_id}' AND d.prod_id = '{prod_id}'\"\n",
    "    query = f\"\"\"MATCH (c:customer),(d:order_line),(p:product)\n",
    "                WHERE    c.customer_id = d.customer_id\n",
    "                AND      d.prod_id = p.prod_id {search_string}\n",
    "                MERGE (c)-[:rated {rating_string}]->(p)\"\"\"\n",
    "    #print(query)\n",
    "    n4j_helper.neo4j_session.run(query)\n",
    "    \n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8272ef29",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "be165c99",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "18797017",
   "metadata": {},
   "source": [
    "# Creating relationship between product and categories\n",
    "# category<-[:part_of]-product"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "id": "c2b24f3d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3178\n",
      "  Relationships: 1522\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (p:product),(c:ctg)\n",
    "WHERE c.ctg_id = p.ctg_id\n",
    "MERGE (p)-[:part_of]->(c)\"\"\"\n",
    "n4j_helper.neo4j_session.run(query)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3755578b",
   "metadata": {},
   "source": [
    "# Creating relationship between product and suppliers\n",
    "# supplier-[:supplies]->product"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "id": "a079131d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3178\n",
      "  Relationships: 1589\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (p:product),(s:supplier)\n",
    "WHERE s.supplier_id = p.supplier_id\n",
    "MERGE (s)-[:supplies]->(p)\"\"\"\n",
    "n4j_helper.neo4j_session.run(query)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a9ca7cbe",
   "metadata": {},
   "source": [
    "# Creating relationship between customer and order\n",
    "# customer-[:orders]->order_header"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "id": "ee3d7709",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3178\n",
      "  Relationships: 2419\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (o:order_header),(c:customer)\n",
    "WHERE c.customer_id = o.customer_id\n",
    "MERGE (c)-[:orders]->(o)\"\"\"\n",
    "n4j_helper.neo4j_session.run(query)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0bb766fc",
   "metadata": {},
   "source": [
    "# Creating relationship between order header and order line\n",
    "# order_header-[:comprised_of]->order_line"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 202,
   "id": "401bce4d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3178\n",
      "  Relationships: 4574\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (o:order_header),(d:order_line)\n",
    "WHERE o.order_id = d.order_id\n",
    "MERGE (o)-[:comprised_of]->(d)\"\"\"\n",
    "n4j_helper.neo4j_session.run(query)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aa470591",
   "metadata": {},
   "source": [
    "# Creating relationship between order line and product\n",
    "# order_line-[:contains]->product"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "id": "59aca49e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3178\n",
      "  Relationships: 6419\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (p:product),(d:order_line)\n",
    "WHERE d.prod_id = p.prod_id\n",
    "MERGE (d)-[:contains]->(p)\"\"\"\n",
    "n4j_helper.neo4j_session.run(query)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "450dde85",
   "metadata": {},
   "source": [
    "# List down total quantity of products purcased by customers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 204,
   "id": "d44ae28f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_name</th>\n",
       "      <th>total_product_qty_purchased</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Save-a-lot Markets</td>\n",
       "      <td>3963</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Ernst Handel</td>\n",
       "      <td>3835</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>QUICK-Stop</td>\n",
       "      <td>3462</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Frankenversand</td>\n",
       "      <td>1434</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Hungry Owl All-Night Grocers</td>\n",
       "      <td>1377</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>The Cracker Box</td>\n",
       "      <td>39</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>North/South</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Lazy K Kountry Store</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Centro comercial Moctezuma</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>89 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                   customer_name  total_product_qty_purchased\n",
       "0             Save-a-lot Markets                         3963\n",
       "1                   Ernst Handel                         3835\n",
       "2                     QUICK-Stop                         3462\n",
       "3                 Frankenversand                         1434\n",
       "4   Hungry Owl All-Night Grocers                         1377\n",
       "..                           ...                          ...\n",
       "84               The Cracker Box                           39\n",
       "85          GROSELLA-Restaurante                           24\n",
       "86                   North/South                           22\n",
       "87          Lazy K Kountry Store                           20\n",
       "88    Centro comercial Moctezuma                           11\n",
       "\n",
       "[89 rows x 2 columns]"
      ]
     },
     "execution_count": 204,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''MATCH (cust:customer)-[:orders]->(oh:order_header)-[:comprised_of]->(od:order_line)-[:contains]->(p:product),\n",
    "      (p)-[:part_of]->(c:ctg)\n",
    "RETURN  DISTINCT cust.customer_name AS customer_name, SUM(od.qty) AS total_product_qty_purchased\n",
    "ORDER BY total_product_qty_purchased DESC\n",
    "'''\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b101645",
   "metadata": {},
   "source": [
    "# List down total quantity of produce purcased by customers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "id": "2057e4d6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_name</th>\n",
       "      <th>total_produce_qty_purchased</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>QUICK-Stop</td>\n",
       "      <td>242</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Ernst Handel</td>\n",
       "      <td>235</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Folk och fä HB</td>\n",
       "      <td>148</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Save-a-lot Markets</td>\n",
       "      <td>137</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Hungry Owl All-Night Grocers</td>\n",
       "      <td>121</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Bon app'</td>\n",
       "      <td>118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Eastern Connection</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Ottilies Käseladen</td>\n",
       "      <td>85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Rattlesnake Canyon Grocery</td>\n",
       "      <td>77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Chop-suey Chinese</td>\n",
       "      <td>71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Wartian Herkku</td>\n",
       "      <td>70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>HILARION-Abastos</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Frankenversand</td>\n",
       "      <td>51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Folies gourmandes</td>\n",
       "      <td>50</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Toms Spezialitäten</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Victuailles en stock</td>\n",
       "      <td>45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Bottom-Dollar Markets</td>\n",
       "      <td>44</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Godos Cocina Típica</td>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Reggiani Caseifici</td>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>B's Beverages</td>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Hanari Carnes</td>\n",
       "      <td>35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Piccolo und mehr</td>\n",
       "      <td>35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Pericles Comidas clásicas</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Gourmet Lanchonetes</td>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Mère Paillarde</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Simons bistro</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>LILA-Supermercado</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Seven Seas Imports</td>\n",
       "      <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Wolski  Zajazd</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Suprêmes délices</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Lonesome Pine Restaurant</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Princesa Isabel Vinhos</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Que Delícia</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Split Rail Beer &amp; Ale</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Old World Delicatessen</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Berglunds snabbköp</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>Franchi S.p.A.</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>Hungry Coyote Import Store</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Santé Gourmet</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Vaffeljernet</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Königlich Essen</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Blauer See Delikatessen</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>Rancho grande</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>Richter Supermarkt</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>La corne d'abondance</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>France restauration</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>Ana Trujillo Emparedados y helados</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>Great Lakes Food Market</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         customer_name  total_produce_qty_purchased\n",
       "0                           QUICK-Stop                          242\n",
       "1                         Ernst Handel                          235\n",
       "2                       Folk och fä HB                          148\n",
       "3                   Save-a-lot Markets                          137\n",
       "4         Hungry Owl All-Night Grocers                          121\n",
       "5                             Bon app'                          118\n",
       "6                   Eastern Connection                          100\n",
       "7                   Ottilies Käseladen                           85\n",
       "8           Rattlesnake Canyon Grocery                           77\n",
       "9                    Chop-suey Chinese                           71\n",
       "10                      Wartian Herkku                           70\n",
       "11                    HILARION-Abastos                           61\n",
       "12                      Frankenversand                           51\n",
       "13                   Folies gourmandes                           50\n",
       "14                  Toms Spezialitäten                           49\n",
       "15                Victuailles en stock                           45\n",
       "16               Bottom-Dollar Markets                           44\n",
       "17                 Godos Cocina Típica                           40\n",
       "18                  Reggiani Caseifici                           40\n",
       "19                       B's Beverages                           37\n",
       "20                       Hanari Carnes                           35\n",
       "21                    Piccolo und mehr                           35\n",
       "22           Pericles Comidas clásicas                           32\n",
       "23                 Gourmet Lanchonetes                           31\n",
       "24                      Mère Paillarde                           30\n",
       "25                       Simons bistro                           30\n",
       "26                   LILA-Supermercado                           29\n",
       "27                  Seven Seas Imports                           28\n",
       "28                      Wolski  Zajazd                           22\n",
       "29                    Suprêmes délices                           20\n",
       "30            Lonesome Pine Restaurant                           20\n",
       "31                     Around the Horn                           20\n",
       "32              Princesa Isabel Vinhos                           18\n",
       "33              Océano Atlántico Ltda.                           18\n",
       "34                         Que Delícia                           17\n",
       "35               Split Rail Beer & Ale                           16\n",
       "36              Old World Delicatessen                           16\n",
       "37                  Berglunds snabbköp                           16\n",
       "38                      Franchi S.p.A.                           15\n",
       "39          Hungry Coyote Import Store                           15\n",
       "40                       Santé Gourmet                           12\n",
       "41                        Vaffeljernet                           10\n",
       "42                     Königlich Essen                            9\n",
       "43             Blauer See Delikatessen                            8\n",
       "44                       Rancho grande                            7\n",
       "45                  Richter Supermarkt                            6\n",
       "46                La corne d'abondance                            5\n",
       "47                 France restauration                            3\n",
       "48  Ana Trujillo Emparedados y helados                            3\n",
       "49             Great Lakes Food Market                            3"
      ]
     },
     "execution_count": 205,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''MATCH (cust:customer)-[:orders]->(oh:order_header)-[:comprised_of]->(od:order_line)-[:contains]->(p:product),\n",
    "      (p)-[:part_of]->(c:ctg {ctg_name:\"Produce\"})\n",
    "RETURN  DISTINCT cust.customer_name AS customer_name, SUM(od.qty) AS total_produce_qty_purchased\n",
    "ORDER BY total_produce_qty_purchased DESC\n",
    "'''\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0c9c1192",
   "metadata": {},
   "source": [
    "# List down each produce purchased along with quantity for each customer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 206,
   "id": "0716599e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_name</th>\n",
       "      <th>prod_name</th>\n",
       "      <th>total_produce_qty_purchased</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>QUICK-Stop</td>\n",
       "      <td>Uncle Bob's Organic Dried Pears</td>\n",
       "      <td>135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Ernst Handel</td>\n",
       "      <td>Manjimup Dried Apples</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Eastern Connection</td>\n",
       "      <td>Uncle Bob's Organic Dried Pears</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>QUICK-Stop</td>\n",
       "      <td>Manjimup Dried Apples</td>\n",
       "      <td>92</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Folk och fä HB</td>\n",
       "      <td>Manjimup Dried Apples</td>\n",
       "      <td>88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>Ana Trujillo Emparedados y helados</td>\n",
       "      <td>Tofu</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>Great Lakes Food Market</td>\n",
       "      <td>Tofu</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>Que Delícia</td>\n",
       "      <td>Manjimup Dried Apples</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>Wolski  Zajazd</td>\n",
       "      <td>Manjimup Dried Apples</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>Rattlesnake Canyon Grocery</td>\n",
       "      <td>Tofu</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>81 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                         customer_name                        prod_name  \\\n",
       "0                           QUICK-Stop  Uncle Bob's Organic Dried Pears   \n",
       "1                         Ernst Handel            Manjimup Dried Apples   \n",
       "2                   Eastern Connection  Uncle Bob's Organic Dried Pears   \n",
       "3                           QUICK-Stop            Manjimup Dried Apples   \n",
       "4                       Folk och fä HB            Manjimup Dried Apples   \n",
       "..                                 ...                              ...   \n",
       "76  Ana Trujillo Emparedados y helados                             Tofu   \n",
       "77             Great Lakes Food Market                             Tofu   \n",
       "78                         Que Delícia            Manjimup Dried Apples   \n",
       "79                      Wolski  Zajazd            Manjimup Dried Apples   \n",
       "80          Rattlesnake Canyon Grocery                             Tofu   \n",
       "\n",
       "    total_produce_qty_purchased  \n",
       "0                           135  \n",
       "1                           120  \n",
       "2                           100  \n",
       "3                            92  \n",
       "4                            88  \n",
       "..                          ...  \n",
       "76                            3  \n",
       "77                            3  \n",
       "78                            2  \n",
       "79                            2  \n",
       "80                            1  \n",
       "\n",
       "[81 rows x 3 columns]"
      ]
     },
     "execution_count": 206,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''MATCH (cust:customer)-[:orders]->(oh:order_header)-[:comprised_of]->(od:order_line)-[:contains]->(p:product),\n",
    "      (p)-[:part_of]->(c:ctg {ctg_name:\"Produce\"})\n",
    "RETURN  DISTINCT cust.customer_name AS customer_name, p.prod_name AS prod_name, SUM(od.qty) AS total_produce_qty_purchased\n",
    "ORDER BY total_produce_qty_purchased DESC\n",
    "'''\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "254c486e",
   "metadata": {},
   "source": [
    "# Lists down products bought by each customer, that is total number of orders aong with total quantities ordered"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "id": "80576803",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_name</th>\n",
       "      <th>category_name</th>\n",
       "      <th>prod_name</th>\n",
       "      <th>total_orders</th>\n",
       "      <th>total_prod_qty_purchased</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Save-a-lot Markets</td>\n",
       "      <td>Seafood</td>\n",
       "      <td>Konbu</td>\n",
       "      <td>4</td>\n",
       "      <td>248</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>QUICK-Stop</td>\n",
       "      <td>Dairy Products</td>\n",
       "      <td>Camembert Pierrot</td>\n",
       "      <td>4</td>\n",
       "      <td>243</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Save-a-lot Markets</td>\n",
       "      <td>Confections</td>\n",
       "      <td>Scottish Longbreads</td>\n",
       "      <td>4</td>\n",
       "      <td>220</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Ernst Handel</td>\n",
       "      <td>Grains/Cereals</td>\n",
       "      <td>Wimmers gute Semmelknödel</td>\n",
       "      <td>4</td>\n",
       "      <td>199</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Save-a-lot Markets</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>3</td>\n",
       "      <td>198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1450</th>\n",
       "      <td>Rattlesnake Canyon Grocery</td>\n",
       "      <td>Produce</td>\n",
       "      <td>Tofu</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1451</th>\n",
       "      <td>Centro comercial Moctezuma</td>\n",
       "      <td>Seafood</td>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1452</th>\n",
       "      <td>Consolidated Holdings</td>\n",
       "      <td>Seafood</td>\n",
       "      <td>Konbu</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1453</th>\n",
       "      <td>Franchi S.p.A.</td>\n",
       "      <td>Seafood</td>\n",
       "      <td>Boston Crab Meat</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1454</th>\n",
       "      <td>Rattlesnake Canyon Grocery</td>\n",
       "      <td>Seafood</td>\n",
       "      <td>Ikura</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1455 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                   customer_name   category_name                  prod_name  \\\n",
       "0             Save-a-lot Markets         Seafood                      Konbu   \n",
       "1                     QUICK-Stop  Dairy Products          Camembert Pierrot   \n",
       "2             Save-a-lot Markets     Confections        Scottish Longbreads   \n",
       "3                   Ernst Handel  Grains/Cereals  Wimmers gute Semmelknödel   \n",
       "4             Save-a-lot Markets       Beverages       Rhönbräu Klosterbier   \n",
       "...                          ...             ...                        ...   \n",
       "1450  Rattlesnake Canyon Grocery         Produce                       Tofu   \n",
       "1451  Centro comercial Moctezuma         Seafood                 Gravad lax   \n",
       "1452       Consolidated Holdings         Seafood                      Konbu   \n",
       "1453              Franchi S.p.A.         Seafood           Boston Crab Meat   \n",
       "1454  Rattlesnake Canyon Grocery         Seafood                      Ikura   \n",
       "\n",
       "      total_orders  total_prod_qty_purchased  \n",
       "0                4                       248  \n",
       "1                4                       243  \n",
       "2                4                       220  \n",
       "3                4                       199  \n",
       "4                3                       198  \n",
       "...            ...                       ...  \n",
       "1450             1                         1  \n",
       "1451             1                         1  \n",
       "1452             1                         1  \n",
       "1453             1                         1  \n",
       "1454             1                         1  \n",
       "\n",
       "[1455 rows x 5 columns]"
      ]
     },
     "execution_count": 207,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''MATCH (cust:customer)-[:orders]->(oh:order_header)-[:comprised_of]->(od:order_line)-[:contains]->(p:product),\n",
    "      (p)-[:part_of]->(c:ctg)\n",
    "RETURN  \n",
    "DISTINCT cust.customer_name AS customer_name\n",
    "       , c.ctg_name         AS category_name\n",
    "       , p.prod_name        AS prod_name\n",
    "       , count(oh.order_id) AS total_orders\n",
    "       , sum(od.qty)        AS total_prod_qty_purchased\n",
    "ORDER BY total_prod_qty_purchased DESC\n",
    "'''\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e802847d",
   "metadata": {},
   "source": [
    "# Content based recommendation where we are recommending similar products (same category) to the customers what other customers have also bought\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 208,
   "id": "e3d0b61f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_name</th>\n",
       "      <th>recommended_product_list</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alfreds Futterkiste</td>\n",
       "      <td>[Chef Anton's Cajun Seasoning, Northwoods Cran...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Ana Trujillo Emparedados y helados</td>\n",
       "      <td>[Flotemysost, Queso Manchego La Pastora, Racle...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>[Flotemysost, Mozzarella di Giovanni, Queso Ma...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>[Ikura, Carnarvon Tigers, Nord-Ost Matjesherin...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B's Beverages</td>\n",
       "      <td>[Chef Anton's Cajun Seasoning, Grandma's Boyse...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>Wartian Herkku</td>\n",
       "      <td>[Aniseed Syrup, Grandma's Boysenberry Spread, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>Wellington Importadora</td>\n",
       "      <td>[Ikura, Jack's New England Clam Chowder, Nord-...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>White Clover Markets</td>\n",
       "      <td>[Aniseed Syrup, Grandma's Boysenberry Spread, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Wilman Kala</td>\n",
       "      <td>[Aniseed Syrup, Chef Anton's Cajun Seasoning, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Wolski  Zajazd</td>\n",
       "      <td>[Queso Cabrales, Gudbrandsdalsost, Flotemysost...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>89 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                         customer_name  \\\n",
       "0                  Alfreds Futterkiste   \n",
       "1   Ana Trujillo Emparedados y helados   \n",
       "2              Antonio Moreno Taquería   \n",
       "3                      Around the Horn   \n",
       "4                        B's Beverages   \n",
       "..                                 ...   \n",
       "84                      Wartian Herkku   \n",
       "85              Wellington Importadora   \n",
       "86                White Clover Markets   \n",
       "87                         Wilman Kala   \n",
       "88                      Wolski  Zajazd   \n",
       "\n",
       "                             recommended_product_list  \n",
       "0   [Chef Anton's Cajun Seasoning, Northwoods Cran...  \n",
       "1   [Flotemysost, Queso Manchego La Pastora, Racle...  \n",
       "2   [Flotemysost, Mozzarella di Giovanni, Queso Ma...  \n",
       "3   [Ikura, Carnarvon Tigers, Nord-Ost Matjesherin...  \n",
       "4   [Chef Anton's Cajun Seasoning, Grandma's Boyse...  \n",
       "..                                                ...  \n",
       "84  [Aniseed Syrup, Grandma's Boysenberry Spread, ...  \n",
       "85  [Ikura, Jack's New England Clam Chowder, Nord-...  \n",
       "86  [Aniseed Syrup, Grandma's Boysenberry Spread, ...  \n",
       "87  [Aniseed Syrup, Chef Anton's Cajun Seasoning, ...  \n",
       "88  [Queso Cabrales, Gudbrandsdalsost, Flotemysost...  \n",
       "\n",
       "[89 rows x 2 columns]"
      ]
     },
     "execution_count": 208,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"MATCH (cust1:customer)-[:rated]->(p:product)\n",
    "MATCH (p)<-[:rated]-(cust2:customer)\n",
    "MATCH (cust2)-[:rated]->(p2:product)\n",
    "MATCH (p2)-[:part_of]->(cat:ctg)\n",
    "MATCH (p)-[:part_of]->(cat)\n",
    "WHERE  NOT EXISTS ((cust1)-[:rated]->(p2))\n",
    "RETURN \n",
    "DISTINCT cust1.customer_name          AS customer_name\n",
    "       , COLLECT(p2.prod_name)        AS recommended_product_list\n",
    "ORDER BY customer_name\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7186e1d7",
   "metadata": {},
   "source": [
    "# Content based recommendation where we are recommending similar products (same category) to the customers that they have not bought yet, but they have previously purchased other products from the same category"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 209,
   "id": "575884f6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_name</th>\n",
       "      <th>recommended_product_list</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alfreds Futterkiste</td>\n",
       "      <td>[Côte de Blaye, Ipoh Coffee, Sasquatch Ale, St...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Ana Trujillo Emparedados y helados</td>\n",
       "      <td>[Côte de Blaye, Lakkalikööri, Ipoh Coffee, Sas...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>[Côte de Blaye, Lakkalikööri, Steeleye Stout, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>[Côte de Blaye, Lakkalikööri, Ipoh Coffee, Sas...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B's Beverages</td>\n",
       "      <td>[Côte de Blaye, Lakkalikööri, Sasquatch Ale, R...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>Wartian Herkku</td>\n",
       "      <td>[Côte de Blaye, Lakkalikööri, Sasquatch Ale, R...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>Wellington Importadora</td>\n",
       "      <td>[Côte de Blaye, Lakkalikööri, Sasquatch Ale, S...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>White Clover Markets</td>\n",
       "      <td>[Lakkalikööri, Ipoh Coffee, Chartreuse verte, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Wilman Kala</td>\n",
       "      <td>[Côte de Blaye, Sasquatch Ale, Steeleye Stout,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Wolski  Zajazd</td>\n",
       "      <td>[Côte de Blaye, Lakkalikööri, Ipoh Coffee, Sas...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>89 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                         customer_name  \\\n",
       "0                  Alfreds Futterkiste   \n",
       "1   Ana Trujillo Emparedados y helados   \n",
       "2              Antonio Moreno Taquería   \n",
       "3                      Around the Horn   \n",
       "4                        B's Beverages   \n",
       "..                                 ...   \n",
       "84                      Wartian Herkku   \n",
       "85              Wellington Importadora   \n",
       "86                White Clover Markets   \n",
       "87                         Wilman Kala   \n",
       "88                      Wolski  Zajazd   \n",
       "\n",
       "                             recommended_product_list  \n",
       "0   [Côte de Blaye, Ipoh Coffee, Sasquatch Ale, St...  \n",
       "1   [Côte de Blaye, Lakkalikööri, Ipoh Coffee, Sas...  \n",
       "2   [Côte de Blaye, Lakkalikööri, Steeleye Stout, ...  \n",
       "3   [Côte de Blaye, Lakkalikööri, Ipoh Coffee, Sas...  \n",
       "4   [Côte de Blaye, Lakkalikööri, Sasquatch Ale, R...  \n",
       "..                                                ...  \n",
       "84  [Côte de Blaye, Lakkalikööri, Sasquatch Ale, R...  \n",
       "85  [Côte de Blaye, Lakkalikööri, Sasquatch Ale, S...  \n",
       "86  [Lakkalikööri, Ipoh Coffee, Chartreuse verte, ...  \n",
       "87  [Côte de Blaye, Sasquatch Ale, Steeleye Stout,...  \n",
       "88  [Côte de Blaye, Lakkalikööri, Ipoh Coffee, Sas...  \n",
       "\n",
       "[89 rows x 2 columns]"
      ]
     },
     "execution_count": 209,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"MATCH (cust1:customer)-[:rated]->(p:product)\n",
    "MATCH (p2)-[:part_of]->(cat:ctg)\n",
    "MATCH (p)-[:part_of]->(cat)\n",
    "WHERE  NOT EXISTS ((cust1)-[:rated]->(p2))\n",
    "RETURN \n",
    "DISTINCT cust1.customer_name          AS customer_name\n",
    "       , COLLECT(p2.prod_name)        AS recommended_product_list\n",
    "ORDER BY customer_name\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ffd48367",
   "metadata": {},
   "source": [
    "# Showing customer's product ratings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 210,
   "id": "dc2b93f2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_name</th>\n",
       "      <th>product_name</th>\n",
       "      <th>rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Centro comercial Moctezuma</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Lazy K Kountry Store</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Lazy K Kountry Store</td>\n",
       "      <td>Boston Crab Meat</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Laughing Bacchus Wine Cellars</td>\n",
       "      <td>Jack's New England Clam Chowder</td>\n",
       "      <td>0.322581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>North/South</td>\n",
       "      <td>Outback Lager</td>\n",
       "      <td>0.300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1450</th>\n",
       "      <td>Ernst Handel</td>\n",
       "      <td>Mascarpone Fabioli</td>\n",
       "      <td>0.001321</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1451</th>\n",
       "      <td>Rattlesnake Canyon Grocery</td>\n",
       "      <td>Grandma's Boysenberry Spread</td>\n",
       "      <td>0.000723</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1452</th>\n",
       "      <td>Rattlesnake Canyon Grocery</td>\n",
       "      <td>Ikura</td>\n",
       "      <td>0.000723</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1453</th>\n",
       "      <td>Rattlesnake Canyon Grocery</td>\n",
       "      <td>Tofu</td>\n",
       "      <td>0.000723</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1454</th>\n",
       "      <td>Rattlesnake Canyon Grocery</td>\n",
       "      <td>Louisiana Hot Spiced Okra</td>\n",
       "      <td>0.000723</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1455 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                      customer_name                     product_name    rating\n",
       "0        Centro comercial Moctezuma              Sir Rodney's Scones  0.909091\n",
       "1              Lazy K Kountry Store                   Queso Cabrales  0.500000\n",
       "2              Lazy K Kountry Store                 Boston Crab Meat  0.500000\n",
       "3     Laughing Bacchus Wine Cellars  Jack's New England Clam Chowder  0.322581\n",
       "4                       North/South                    Outback Lager  0.300000\n",
       "...                             ...                              ...       ...\n",
       "1450                   Ernst Handel               Mascarpone Fabioli  0.001321\n",
       "1451     Rattlesnake Canyon Grocery     Grandma's Boysenberry Spread  0.000723\n",
       "1452     Rattlesnake Canyon Grocery                            Ikura  0.000723\n",
       "1453     Rattlesnake Canyon Grocery                             Tofu  0.000723\n",
       "1454     Rattlesnake Canyon Grocery        Louisiana Hot Spiced Okra  0.000723\n",
       "\n",
       "[1455 rows x 3 columns]"
      ]
     },
     "execution_count": 210,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"MATCH (me:customer)-[r:rated]->(p:product)\n",
    "RETURN \n",
    "DISTINCT me.customer_name AS customer_name\n",
    "       , p.prod_name      AS product_name\n",
    "       , r.rating         AS rating\n",
    "ORDER BY rating DESC\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a2c64a4f",
   "metadata": {},
   "source": [
    "# List down product rating difference for a particular customer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 211,
   "id": "a2f8b6ec",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_1</th>\n",
       "      <th>customer_2</th>\n",
       "      <th>product_rated</th>\n",
       "      <th>rating_given_by_customer_1</th>\n",
       "      <th>rating_given_by_customer_2</th>\n",
       "      <th>rating_difference</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_WARTH</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.013569</td>\n",
       "      <td>0.895522</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_QUICK</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.015148</td>\n",
       "      <td>0.893943</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_GODOS</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.015190</td>\n",
       "      <td>0.893901</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_OLDWO</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.024876</td>\n",
       "      <td>0.884215</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_ERNSH</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.026414</td>\n",
       "      <td>0.882677</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_QUEEN</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.029098</td>\n",
       "      <td>0.879993</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_LINOD</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.030928</td>\n",
       "      <td>0.878163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_SUPRD</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.033582</td>\n",
       "      <td>0.875509</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_MEREP</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.043478</td>\n",
       "      <td>0.865613</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_KOENE</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.044297</td>\n",
       "      <td>0.864794</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_LILAS</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.047847</td>\n",
       "      <td>0.861244</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_WHITC</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.048918</td>\n",
       "      <td>0.860173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_QUEDE</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.050761</td>\n",
       "      <td>0.858329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_RANCH</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.054348</td>\n",
       "      <td>0.854743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_DUMON</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.075000</td>\n",
       "      <td>0.834091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_FRANK</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.076721</td>\n",
       "      <td>0.832370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_SIMOB</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.079365</td>\n",
       "      <td>0.829726</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_WANDK</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.081301</td>\n",
       "      <td>0.827790</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_CHOPS</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.086022</td>\n",
       "      <td>0.823069</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_OCEAN</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.818182</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_GREAL</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.092754</td>\n",
       "      <td>0.816337</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_BSBEV</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.098976</td>\n",
       "      <td>0.810115</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_FOLIG</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.112994</td>\n",
       "      <td>0.796097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_MAISD</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.125000</td>\n",
       "      <td>0.784091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_WILMK</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.135135</td>\n",
       "      <td>0.773956</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_BLAUS</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.164286</td>\n",
       "      <td>0.744805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_PRINI</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.168478</td>\n",
       "      <td>0.740613</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_LETSS</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.220994</td>\n",
       "      <td>0.688096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_SAVEA</td>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.012102</td>\n",
       "      <td>0.078807</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_CHOPS</td>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.017204</td>\n",
       "      <td>0.073705</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_FRANK</td>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.018361</td>\n",
       "      <td>0.072548</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_SEVES</td>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.022005</td>\n",
       "      <td>0.068904</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_FOLIG</td>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>0.090909</td>\n",
       "      <td>0.028249</td>\n",
       "      <td>0.062661</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    customer_1  customer_2        product_rated  rating_given_by_customer_1  \\\n",
       "0   cust_CENTC  cust_WARTH  Sir Rodney's Scones                    0.909091   \n",
       "1   cust_CENTC  cust_QUICK  Sir Rodney's Scones                    0.909091   \n",
       "2   cust_CENTC  cust_GODOS  Sir Rodney's Scones                    0.909091   \n",
       "3   cust_CENTC  cust_OLDWO  Sir Rodney's Scones                    0.909091   \n",
       "4   cust_CENTC  cust_ERNSH  Sir Rodney's Scones                    0.909091   \n",
       "5   cust_CENTC  cust_QUEEN  Sir Rodney's Scones                    0.909091   \n",
       "6   cust_CENTC  cust_LINOD  Sir Rodney's Scones                    0.909091   \n",
       "7   cust_CENTC  cust_SUPRD  Sir Rodney's Scones                    0.909091   \n",
       "8   cust_CENTC  cust_MEREP  Sir Rodney's Scones                    0.909091   \n",
       "9   cust_CENTC  cust_KOENE  Sir Rodney's Scones                    0.909091   \n",
       "10  cust_CENTC  cust_LILAS  Sir Rodney's Scones                    0.909091   \n",
       "11  cust_CENTC  cust_WHITC  Sir Rodney's Scones                    0.909091   \n",
       "12  cust_CENTC  cust_QUEDE  Sir Rodney's Scones                    0.909091   \n",
       "13  cust_CENTC  cust_RANCH  Sir Rodney's Scones                    0.909091   \n",
       "14  cust_CENTC  cust_DUMON  Sir Rodney's Scones                    0.909091   \n",
       "15  cust_CENTC  cust_FRANK  Sir Rodney's Scones                    0.909091   \n",
       "16  cust_CENTC  cust_SIMOB  Sir Rodney's Scones                    0.909091   \n",
       "17  cust_CENTC  cust_WANDK  Sir Rodney's Scones                    0.909091   \n",
       "18  cust_CENTC  cust_CHOPS  Sir Rodney's Scones                    0.909091   \n",
       "19  cust_CENTC  cust_OCEAN  Sir Rodney's Scones                    0.909091   \n",
       "20  cust_CENTC  cust_GREAL  Sir Rodney's Scones                    0.909091   \n",
       "21  cust_CENTC  cust_BSBEV  Sir Rodney's Scones                    0.909091   \n",
       "22  cust_CENTC  cust_FOLIG  Sir Rodney's Scones                    0.909091   \n",
       "23  cust_CENTC  cust_MAISD  Sir Rodney's Scones                    0.909091   \n",
       "24  cust_CENTC  cust_WILMK  Sir Rodney's Scones                    0.909091   \n",
       "25  cust_CENTC  cust_BLAUS  Sir Rodney's Scones                    0.909091   \n",
       "26  cust_CENTC  cust_PRINI  Sir Rodney's Scones                    0.909091   \n",
       "27  cust_CENTC  cust_LETSS  Sir Rodney's Scones                    0.909091   \n",
       "28  cust_CENTC  cust_SAVEA           Gravad lax                    0.090909   \n",
       "29  cust_CENTC  cust_CHOPS           Gravad lax                    0.090909   \n",
       "30  cust_CENTC  cust_FRANK           Gravad lax                    0.090909   \n",
       "31  cust_CENTC  cust_SEVES           Gravad lax                    0.090909   \n",
       "32  cust_CENTC  cust_FOLIG           Gravad lax                    0.090909   \n",
       "\n",
       "    rating_given_by_customer_2  rating_difference  \n",
       "0                     0.013569           0.895522  \n",
       "1                     0.015148           0.893943  \n",
       "2                     0.015190           0.893901  \n",
       "3                     0.024876           0.884215  \n",
       "4                     0.026414           0.882677  \n",
       "5                     0.029098           0.879993  \n",
       "6                     0.030928           0.878163  \n",
       "7                     0.033582           0.875509  \n",
       "8                     0.043478           0.865613  \n",
       "9                     0.044297           0.864794  \n",
       "10                    0.047847           0.861244  \n",
       "11                    0.048918           0.860173  \n",
       "12                    0.050761           0.858329  \n",
       "13                    0.054348           0.854743  \n",
       "14                    0.075000           0.834091  \n",
       "15                    0.076721           0.832370  \n",
       "16                    0.079365           0.829726  \n",
       "17                    0.081301           0.827790  \n",
       "18                    0.086022           0.823069  \n",
       "19                    0.090909           0.818182  \n",
       "20                    0.092754           0.816337  \n",
       "21                    0.098976           0.810115  \n",
       "22                    0.112994           0.796097  \n",
       "23                    0.125000           0.784091  \n",
       "24                    0.135135           0.773956  \n",
       "25                    0.164286           0.744805  \n",
       "26                    0.168478           0.740613  \n",
       "27                    0.220994           0.688096  \n",
       "28                    0.012102           0.078807  \n",
       "29                    0.017204           0.073705  \n",
       "30                    0.018361           0.072548  \n",
       "31                    0.022005           0.068904  \n",
       "32                    0.028249           0.062661  "
      ]
     },
     "execution_count": 211,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"MATCH (c1:customer)-[r1:rated]->(p:product)<-[r2:rated]-(c2:customer)\n",
    "WHERE c1.customer_id = 'cust_CENTC'\n",
    "RETURN c1.customer_id AS customer_1\n",
    "     , c2.customer_id AS customer_2\n",
    "     , p.prod_name AS product_rated\n",
    "     , r1.rating   AS rating_given_by_customer_1\n",
    "     , r2.rating   AS rating_given_by_customer_2\n",
    "     , ABS(r1.rating - r2.rating) AS rating_difference\n",
    "ORDER BY rating_difference DESC\n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 212,
   "id": "0a69dfe5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_1</th>\n",
       "      <th>customer_2</th>\n",
       "      <th>product_rated</th>\n",
       "      <th>rating_given_by_customer_1</th>\n",
       "      <th>rating_given_by_customer_2</th>\n",
       "      <th>rating_difference</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cust_WARTH</td>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.013569</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.895522</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_WARTH</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.013569</td>\n",
       "      <td>0.895522</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>cust_QUICK</td>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.015148</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.893943</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>cust_QUICK</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.015148</td>\n",
       "      <td>0.893943</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cust_GODOS</td>\n",
       "      <td>cust_CENTC</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.015190</td>\n",
       "      <td>0.909091</td>\n",
       "      <td>0.893901</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35283</th>\n",
       "      <td>cust_BERGS</td>\n",
       "      <td>cust_SAVEA</td>\n",
       "      <td>Jack's New England Clam Chowder</td>\n",
       "      <td>0.039960</td>\n",
       "      <td>0.039935</td>\n",
       "      <td>0.000025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35284</th>\n",
       "      <td>cust_WARTH</td>\n",
       "      <td>cust_FOLIG</td>\n",
       "      <td>Raclette Courdavault</td>\n",
       "      <td>0.033921</td>\n",
       "      <td>0.033898</td>\n",
       "      <td>0.000023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35285</th>\n",
       "      <td>cust_FOLIG</td>\n",
       "      <td>cust_WARTH</td>\n",
       "      <td>Raclette Courdavault</td>\n",
       "      <td>0.033898</td>\n",
       "      <td>0.033921</td>\n",
       "      <td>0.000023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35286</th>\n",
       "      <td>cust_FRANS</td>\n",
       "      <td>cust_RICSU</td>\n",
       "      <td>Camembert Pierrot</td>\n",
       "      <td>0.074074</td>\n",
       "      <td>0.074074</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35287</th>\n",
       "      <td>cust_RICSU</td>\n",
       "      <td>cust_FRANS</td>\n",
       "      <td>Camembert Pierrot</td>\n",
       "      <td>0.074074</td>\n",
       "      <td>0.074074</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>35288 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       customer_1  customer_2                    product_rated  \\\n",
       "0      cust_WARTH  cust_CENTC              Sir Rodney's Scones   \n",
       "1      cust_CENTC  cust_WARTH              Sir Rodney's Scones   \n",
       "2      cust_QUICK  cust_CENTC              Sir Rodney's Scones   \n",
       "3      cust_CENTC  cust_QUICK              Sir Rodney's Scones   \n",
       "4      cust_GODOS  cust_CENTC              Sir Rodney's Scones   \n",
       "...           ...         ...                              ...   \n",
       "35283  cust_BERGS  cust_SAVEA  Jack's New England Clam Chowder   \n",
       "35284  cust_WARTH  cust_FOLIG             Raclette Courdavault   \n",
       "35285  cust_FOLIG  cust_WARTH             Raclette Courdavault   \n",
       "35286  cust_FRANS  cust_RICSU                Camembert Pierrot   \n",
       "35287  cust_RICSU  cust_FRANS                Camembert Pierrot   \n",
       "\n",
       "       rating_given_by_customer_1  rating_given_by_customer_2  \\\n",
       "0                        0.013569                    0.909091   \n",
       "1                        0.909091                    0.013569   \n",
       "2                        0.015148                    0.909091   \n",
       "3                        0.909091                    0.015148   \n",
       "4                        0.015190                    0.909091   \n",
       "...                           ...                         ...   \n",
       "35283                    0.039960                    0.039935   \n",
       "35284                    0.033921                    0.033898   \n",
       "35285                    0.033898                    0.033921   \n",
       "35286                    0.074074                    0.074074   \n",
       "35287                    0.074074                    0.074074   \n",
       "\n",
       "       rating_difference  \n",
       "0               0.895522  \n",
       "1               0.895522  \n",
       "2               0.893943  \n",
       "3               0.893943  \n",
       "4               0.893901  \n",
       "...                  ...  \n",
       "35283           0.000025  \n",
       "35284           0.000023  \n",
       "35285           0.000023  \n",
       "35286           0.000000  \n",
       "35287           0.000000  \n",
       "\n",
       "[35288 rows x 6 columns]"
      ]
     },
     "execution_count": 212,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"MATCH (c1:customer)-[r1:rated]->(p:product)<-[r2:rated]-(c2:customer)\n",
    "RETURN c1.customer_id AS customer_1\n",
    "     , c2.customer_id AS customer_2\n",
    "     , p.prod_name AS product_rated\n",
    "     , r1.rating   AS rating_given_by_customer_1\n",
    "     , r2.rating   AS rating_given_by_customer_2\n",
    "     , ABS(r1.rating - r2.rating) AS rating_difference\n",
    "ORDER BY rating_difference DESC\n",
    "\"\"\"\n",
    "df_rating_diff = n4j_helper.neo4j_run_query_pandas(query)\n",
    "df_rating_diff"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 248,
   "id": "124ea007",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer1</th>\n",
       "      <th>customer2</th>\n",
       "      <th>product_name</th>\n",
       "      <th>rating_by_customer_1</th>\n",
       "      <th>rating_by_customer_2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.206128</td>\n",
       "      <td>0.208333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.206128</td>\n",
       "      <td>0.227273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>Lazy K Kountry Store</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.206128</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.208333</td>\n",
       "      <td>0.206128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.208333</td>\n",
       "      <td>0.227273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Lazy K Kountry Store</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.208333</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Rancho grande</td>\n",
       "      <td>Lazy K Kountry Store</td>\n",
       "      <td>Boston Crab Meat</td>\n",
       "      <td>0.217391</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Let's Stop N Shop</td>\n",
       "      <td>Centro comercial Moctezuma</td>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>0.220994</td>\n",
       "      <td>0.909091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Trail's Head Gourmet Provisioners</td>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.224719</td>\n",
       "      <td>0.263158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Trail's Head Gourmet Provisioners</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.224719</td>\n",
       "      <td>0.291667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Trail's Head Gourmet Provisioners</td>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.224719</td>\n",
       "      <td>0.294118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.227273</td>\n",
       "      <td>0.206128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.227273</td>\n",
       "      <td>0.208333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Lazy K Kountry Store</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.227273</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>La corne d'abondance</td>\n",
       "      <td>France restauration</td>\n",
       "      <td>Lakkalikööri</td>\n",
       "      <td>0.240964</td>\n",
       "      <td>0.289855</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Trail's Head Gourmet Provisioners</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.224719</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.291667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.294118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>France restauration</td>\n",
       "      <td>La corne d'abondance</td>\n",
       "      <td>Lakkalikööri</td>\n",
       "      <td>0.289855</td>\n",
       "      <td>0.240964</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Trail's Head Gourmet Provisioners</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.291667</td>\n",
       "      <td>0.224719</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.291667</td>\n",
       "      <td>0.263158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.291667</td>\n",
       "      <td>0.294118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>Trail's Head Gourmet Provisioners</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.294118</td>\n",
       "      <td>0.224719</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.294118</td>\n",
       "      <td>0.263158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.294118</td>\n",
       "      <td>0.291667</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                            customer1                          customer2  \\\n",
       "0             Antonio Moreno Taquería               Spécialités du monde   \n",
       "1             Antonio Moreno Taquería             Océano Atlántico Ltda.   \n",
       "2             Antonio Moreno Taquería               Lazy K Kountry Store   \n",
       "3                Spécialités du monde            Antonio Moreno Taquería   \n",
       "4                Spécialités du monde             Océano Atlántico Ltda.   \n",
       "5                Spécialités du monde               Lazy K Kountry Store   \n",
       "6                       Rancho grande               Lazy K Kountry Store   \n",
       "7                   Let's Stop N Shop         Centro comercial Moctezuma   \n",
       "8   Trail's Head Gourmet Provisioners          Bólido Comidas preparadas   \n",
       "9   Trail's Head Gourmet Provisioners               Spécialités du monde   \n",
       "10  Trail's Head Gourmet Provisioners               GROSELLA-Restaurante   \n",
       "11             Océano Atlántico Ltda.            Antonio Moreno Taquería   \n",
       "12             Océano Atlántico Ltda.               Spécialités du monde   \n",
       "13             Océano Atlántico Ltda.               Lazy K Kountry Store   \n",
       "14               La corne d'abondance                France restauration   \n",
       "15          Bólido Comidas preparadas  Trail's Head Gourmet Provisioners   \n",
       "16          Bólido Comidas preparadas               Spécialités du monde   \n",
       "17          Bólido Comidas preparadas               GROSELLA-Restaurante   \n",
       "18                France restauration               La corne d'abondance   \n",
       "19               Spécialités du monde  Trail's Head Gourmet Provisioners   \n",
       "20               Spécialités du monde          Bólido Comidas preparadas   \n",
       "21               Spécialités du monde               GROSELLA-Restaurante   \n",
       "22               GROSELLA-Restaurante  Trail's Head Gourmet Provisioners   \n",
       "23               GROSELLA-Restaurante          Bólido Comidas preparadas   \n",
       "24               GROSELLA-Restaurante               Spécialités du monde   \n",
       "\n",
       "            product_name  rating_by_customer_1  rating_by_customer_2  \n",
       "0         Queso Cabrales              0.206128              0.208333  \n",
       "1         Queso Cabrales              0.206128              0.227273  \n",
       "2         Queso Cabrales              0.206128              0.500000  \n",
       "3         Queso Cabrales              0.208333              0.206128  \n",
       "4         Queso Cabrales              0.208333              0.227273  \n",
       "5         Queso Cabrales              0.208333              0.500000  \n",
       "6       Boston Crab Meat              0.217391              0.500000  \n",
       "7    Sir Rodney's Scones              0.220994              0.909091  \n",
       "8   Rhönbräu Klosterbier              0.224719              0.263158  \n",
       "9   Rhönbräu Klosterbier              0.224719              0.291667  \n",
       "10  Rhönbräu Klosterbier              0.224719              0.294118  \n",
       "11        Queso Cabrales              0.227273              0.206128  \n",
       "12        Queso Cabrales              0.227273              0.208333  \n",
       "13        Queso Cabrales              0.227273              0.500000  \n",
       "14          Lakkalikööri              0.240964              0.289855  \n",
       "15  Rhönbräu Klosterbier              0.263158              0.224719  \n",
       "16  Rhönbräu Klosterbier              0.263158              0.291667  \n",
       "17  Rhönbräu Klosterbier              0.263158              0.294118  \n",
       "18          Lakkalikööri              0.289855              0.240964  \n",
       "19  Rhönbräu Klosterbier              0.291667              0.224719  \n",
       "20  Rhönbräu Klosterbier              0.291667              0.263158  \n",
       "21  Rhönbräu Klosterbier              0.291667              0.294118  \n",
       "22  Rhönbräu Klosterbier              0.294118              0.224719  \n",
       "23  Rhönbräu Klosterbier              0.294118              0.263158  \n",
       "24  Rhönbräu Klosterbier              0.294118              0.291667  "
      ]
     },
     "execution_count": 248,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"MATCH (c1:customer)-[r1:rated]->(p:product)<-[r2:rated]-(c2:customer)\n",
    "WHERE  r1.rating - r2.rating < .1 and r1.rating > .2 and r2.rating > .2\n",
    "RETURN c1.customer_name AS customer1, \n",
    "       c2.customer_name AS customer2, \n",
    "       p.prod_name AS product_name, \n",
    "       r1.rating AS rating_by_customer_1, \n",
    "       r2.rating AS rating_by_customer_2\n",
    "ORDER BY r1.rating, r2.rating\n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 249,
   "id": "9a6f5c8b",
   "metadata": {},
   "outputs": [],
   "source": [
    "cust_pair_dict = {}\n",
    "cust_pair_prod_list = []\n",
    "for e in df_rating_diff.values.tolist():\n",
    "    #print('_'.join(sorted([e[0], e[1]])))\n",
    "    if '_'.join(sorted([e[0], e[1]])) not in cust_pair_dict.keys() and abs(e[-2]-e[-3]) >= 0 and abs(e[-2]-e[-3]) < .01 and e[-2] > .2 and e[-3] > .2:\n",
    "        cust_pair_prod_list.append([e[0], e[1], e[2]])\n",
    "        cust_pair_dict['_'.join(sorted([e[0], e[1]]))] = 1\n",
    "        \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 250,
   "id": "1265ad21",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['cust_SPECD', 'cust_GROSR', 'Rhönbräu Klosterbier'],\n",
       " ['cust_SPECD', 'cust_ANTON', 'Queso Cabrales']]"
      ]
     },
     "execution_count": 250,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cust_pair_prod_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 251,
   "id": "36193922",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c1</th>\n",
       "      <th>p</th>\n",
       "      <th>c2</th>\n",
       "      <th>r1</th>\n",
       "      <th>r2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(customer_name, customer_id, total_orders)</td>\n",
       "      <td>(supplier_id, ctg_id, prod_name, prod_id)</td>\n",
       "      <td>(customer_name, customer_id, total_orders)</td>\n",
       "      <td>(rating)</td>\n",
       "      <td>(rating)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           c1  \\\n",
       "0  (customer_name, customer_id, total_orders)   \n",
       "\n",
       "                                           p  \\\n",
       "0  (supplier_id, ctg_id, prod_name, prod_id)   \n",
       "\n",
       "                                           c2        r1        r2  \n",
       "0  (customer_name, customer_id, total_orders)  (rating)  (rating)  "
      ]
     },
     "execution_count": 251,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"MATCH (c1:customer)-[r1:rated]->(p:product)<-[r2:rated]-(c2:customer)\n",
    "WHERE   c1.customer_id =\"cust_KOENE\" and c2.customer_id =\"cust_TRADH\"\n",
    "    and p.prod_name in ['Tarte au sucre','Pavlova']\n",
    "RETURN c1, p, c2 , r1, r2 \"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 252,
   "id": "7dc7b626",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_1</th>\n",
       "      <th>customer_2</th>\n",
       "      <th>product_rated</th>\n",
       "      <th>rating_given_by_customer_1</th>\n",
       "      <th>rating_given_by_customer_2</th>\n",
       "      <th>rating_difference</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>28760</th>\n",
       "      <td>cust_KOENE</td>\n",
       "      <td>cust_TRADH</td>\n",
       "      <td>Tarte au sucre</td>\n",
       "      <td>0.049834</td>\n",
       "      <td>0.039841</td>\n",
       "      <td>0.009993</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       customer_1  customer_2   product_rated  rating_given_by_customer_1  \\\n",
       "28760  cust_KOENE  cust_TRADH  Tarte au sucre                    0.049834   \n",
       "\n",
       "       rating_given_by_customer_2  rating_difference  \n",
       "28760                    0.039841           0.009993  "
      ]
     },
     "execution_count": 252,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_rating_diff[(df_rating_diff.customer_1 == \"cust_KOENE\") & (df_rating_diff.customer_2 == 'cust_TRADH') & (df_rating_diff.product_rated == 'Tarte au sucre')]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "466fcbed",
   "metadata": {},
   "source": [
    "# Creating similarity between customers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 253,
   "id": "77ab05ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3245\n",
      "  Relationships: 10033\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (c1:customer)-[r1:rated]->(p:product)<-[r2:rated]-(c2:customer)\n",
    "WITH\n",
    "    SUM(r1.rating*r2.rating) as dot_product,\n",
    "    SQRT( REDUCE(x=0.0, a IN COLLECT(r1.rating) | x + a^2) ) as r1_length,\n",
    "    SQRT( REDUCE(y=0.0, b IN COLLECT(r2.rating) | y + b^2) ) as r2_length,\n",
    "    c1,c2\n",
    "MERGE (c1)-[s:similarity]-(c2)\n",
    "SET s.similarity = dot_product / (r1_length * r2_length)\n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "id": "63ee32da",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_1</th>\n",
       "      <th>customer_2</th>\n",
       "      <th>product_rated</th>\n",
       "      <th>rating_given_by_customer_1</th>\n",
       "      <th>rating_given_by_customer_2</th>\n",
       "      <th>rating_difference</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cust_FRANK</td>\n",
       "      <td>cust_TRAIH</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.009836</td>\n",
       "      <td>0.202247</td>\n",
       "      <td>0.192411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>cust_TRAIH</td>\n",
       "      <td>cust_FRANK</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.202247</td>\n",
       "      <td>0.009836</td>\n",
       "      <td>0.192411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>cust_LETSS</td>\n",
       "      <td>cust_TRAIH</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.011050</td>\n",
       "      <td>0.202247</td>\n",
       "      <td>0.191197</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>cust_TRAIH</td>\n",
       "      <td>cust_LETSS</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.202247</td>\n",
       "      <td>0.011050</td>\n",
       "      <td>0.191197</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cust_ALFKI</td>\n",
       "      <td>cust_TRAIH</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.011494</td>\n",
       "      <td>0.202247</td>\n",
       "      <td>0.190753</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>751</th>\n",
       "      <td>cust_LETSS</td>\n",
       "      <td>cust_ALFKI</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.011050</td>\n",
       "      <td>0.011494</td>\n",
       "      <td>0.000445</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>752</th>\n",
       "      <td>cust_HANAR</td>\n",
       "      <td>cust_VAFFE</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.083433</td>\n",
       "      <td>0.083333</td>\n",
       "      <td>0.000099</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>753</th>\n",
       "      <td>cust_VAFFE</td>\n",
       "      <td>cust_HANAR</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.083333</td>\n",
       "      <td>0.083433</td>\n",
       "      <td>0.000099</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>754</th>\n",
       "      <td>cust_LEHMS</td>\n",
       "      <td>cust_QUICK</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.031486</td>\n",
       "      <td>0.031558</td>\n",
       "      <td>0.000072</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>755</th>\n",
       "      <td>cust_QUICK</td>\n",
       "      <td>cust_LEHMS</td>\n",
       "      <td>Original Frankfurter grüne Soße</td>\n",
       "      <td>0.031558</td>\n",
       "      <td>0.031486</td>\n",
       "      <td>0.000072</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>756 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     customer_1  customer_2                    product_rated  \\\n",
       "0    cust_FRANK  cust_TRAIH  Original Frankfurter grüne Soße   \n",
       "1    cust_TRAIH  cust_FRANK  Original Frankfurter grüne Soße   \n",
       "2    cust_LETSS  cust_TRAIH  Original Frankfurter grüne Soße   \n",
       "3    cust_TRAIH  cust_LETSS  Original Frankfurter grüne Soße   \n",
       "4    cust_ALFKI  cust_TRAIH  Original Frankfurter grüne Soße   \n",
       "..          ...         ...                              ...   \n",
       "751  cust_LETSS  cust_ALFKI  Original Frankfurter grüne Soße   \n",
       "752  cust_HANAR  cust_VAFFE  Original Frankfurter grüne Soße   \n",
       "753  cust_VAFFE  cust_HANAR  Original Frankfurter grüne Soße   \n",
       "754  cust_LEHMS  cust_QUICK  Original Frankfurter grüne Soße   \n",
       "755  cust_QUICK  cust_LEHMS  Original Frankfurter grüne Soße   \n",
       "\n",
       "     rating_given_by_customer_1  rating_given_by_customer_2  rating_difference  \n",
       "0                      0.009836                    0.202247           0.192411  \n",
       "1                      0.202247                    0.009836           0.192411  \n",
       "2                      0.011050                    0.202247           0.191197  \n",
       "3                      0.202247                    0.011050           0.191197  \n",
       "4                      0.011494                    0.202247           0.190753  \n",
       "..                          ...                         ...                ...  \n",
       "751                    0.011050                    0.011494           0.000445  \n",
       "752                    0.083433                    0.083333           0.000099  \n",
       "753                    0.083333                    0.083433           0.000099  \n",
       "754                    0.031486                    0.031558           0.000072  \n",
       "755                    0.031558                    0.031486           0.000072  \n",
       "\n",
       "[756 rows x 6 columns]"
      ]
     },
     "execution_count": 254,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"MATCH (c1:customer)-[r1:rated]->(p:product)<-[r2:rated]-(c2:customer)\n",
    "WHERE p.prod_name = 'Original Frankfurter grüne Soße'\n",
    "RETURN \n",
    "DISTINCT c1.customer_id AS customer_1\n",
    "       , c2.customer_id AS customer_2\n",
    "       , p.prod_name AS product_rated\n",
    "       , r1.rating   AS rating_given_by_customer_1\n",
    "       , r2.rating   AS rating_given_by_customer_2\n",
    "       , ABS(r1.rating - r2.rating) AS rating_difference\n",
    "ORDER BY rating_difference DESC\n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 260,
   "id": "82c183ab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_1_name</th>\n",
       "      <th>customer_2_name</th>\n",
       "      <th>product_rated</th>\n",
       "      <th>rating_given_by_customer_1</th>\n",
       "      <th>rating_given_by_customer_2</th>\n",
       "      <th>rating_difference</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>La corne d'abondance</td>\n",
       "      <td>France restauration</td>\n",
       "      <td>Lakkalikööri</td>\n",
       "      <td>0.240964</td>\n",
       "      <td>0.289855</td>\n",
       "      <td>0.048891</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>France restauration</td>\n",
       "      <td>La corne d'abondance</td>\n",
       "      <td>Lakkalikööri</td>\n",
       "      <td>0.289855</td>\n",
       "      <td>0.240964</td>\n",
       "      <td>0.048891</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Trail's Head Gourmet Provisioners</td>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.224719</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.038439</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Trail's Head Gourmet Provisioners</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.224719</td>\n",
       "      <td>0.038439</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.294118</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.030960</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>GROSELLA-Restaurante</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.294118</td>\n",
       "      <td>0.030960</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.291667</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.028509</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Bólido Comidas preparadas</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>0.263158</td>\n",
       "      <td>0.291667</td>\n",
       "      <td>0.028509</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.227273</td>\n",
       "      <td>0.206128</td>\n",
       "      <td>0.021145</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Antonio Moreno Taquería</td>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.206128</td>\n",
       "      <td>0.227273</td>\n",
       "      <td>0.021145</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.208333</td>\n",
       "      <td>0.227273</td>\n",
       "      <td>0.018939</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Océano Atlántico Ltda.</td>\n",
       "      <td>Spécialités du monde</td>\n",
       "      <td>Queso Cabrales</td>\n",
       "      <td>0.227273</td>\n",
       "      <td>0.208333</td>\n",
       "      <td>0.018939</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      customer_1_name                    customer_2_name  \\\n",
       "0                La corne d'abondance                France restauration   \n",
       "1                 France restauration               La corne d'abondance   \n",
       "2   Trail's Head Gourmet Provisioners          Bólido Comidas preparadas   \n",
       "3           Bólido Comidas preparadas  Trail's Head Gourmet Provisioners   \n",
       "4                GROSELLA-Restaurante          Bólido Comidas preparadas   \n",
       "5           Bólido Comidas preparadas               GROSELLA-Restaurante   \n",
       "6                Spécialités du monde          Bólido Comidas preparadas   \n",
       "7           Bólido Comidas preparadas               Spécialités du monde   \n",
       "8              Océano Atlántico Ltda.            Antonio Moreno Taquería   \n",
       "9             Antonio Moreno Taquería             Océano Atlántico Ltda.   \n",
       "10               Spécialités du monde             Océano Atlántico Ltda.   \n",
       "11             Océano Atlántico Ltda.               Spécialités du monde   \n",
       "\n",
       "           product_rated  rating_given_by_customer_1  \\\n",
       "0           Lakkalikööri                    0.240964   \n",
       "1           Lakkalikööri                    0.289855   \n",
       "2   Rhönbräu Klosterbier                    0.224719   \n",
       "3   Rhönbräu Klosterbier                    0.263158   \n",
       "4   Rhönbräu Klosterbier                    0.294118   \n",
       "5   Rhönbräu Klosterbier                    0.263158   \n",
       "6   Rhönbräu Klosterbier                    0.291667   \n",
       "7   Rhönbräu Klosterbier                    0.263158   \n",
       "8         Queso Cabrales                    0.227273   \n",
       "9         Queso Cabrales                    0.206128   \n",
       "10        Queso Cabrales                    0.208333   \n",
       "11        Queso Cabrales                    0.227273   \n",
       "\n",
       "    rating_given_by_customer_2  rating_difference  \n",
       "0                     0.289855           0.048891  \n",
       "1                     0.240964           0.048891  \n",
       "2                     0.263158           0.038439  \n",
       "3                     0.224719           0.038439  \n",
       "4                     0.263158           0.030960  \n",
       "5                     0.294118           0.030960  \n",
       "6                     0.263158           0.028509  \n",
       "7                     0.291667           0.028509  \n",
       "8                     0.206128           0.021145  \n",
       "9                     0.227273           0.021145  \n",
       "10                    0.227273           0.018939  \n",
       "11                    0.208333           0.018939  "
      ]
     },
     "execution_count": 260,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"MATCH (c1:customer)-[r1:rated]->(p:product)<-[r2:rated]-(c2:customer)\n",
    "WHERE r1.rating > .2\n",
    "AND   r2.rating > .2\n",
    "AND   ABS(r1.rating - r2.rating) > .01 \n",
    "AND   ABS(r1.rating - r2.rating) < .05\n",
    "RETURN \n",
    "DISTINCT c1.customer_name AS customer_1_name\n",
    "       , c2.customer_name AS customer_2_name\n",
    "       , p.prod_name      AS product_rated\n",
    "       , r1.rating        AS rating_given_by_customer_1\n",
    "       , r2.rating        AS rating_given_by_customer_2\n",
    "       , ABS(r1.rating - r2.rating) AS rating_difference\n",
    "ORDER BY rating_difference DESC\n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "583d8d0c",
   "metadata": {},
   "source": [
    "# Collaborative filtering where we recommend based on customer similarity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 263,
   "id": "a311d72b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.prod_name</th>\n",
       "      <th>customers</th>\n",
       "      <th>recommendation</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Escargots de Bourgogne</td>\n",
       "      <td>[Alfreds Futterkiste]</td>\n",
       "      <td>0.229885</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Gorgonzola Telino</td>\n",
       "      <td>[Around the Horn]</td>\n",
       "      <td>0.176923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Sir Rodney's Scones</td>\n",
       "      <td>[Blauer See Delikatessen]</td>\n",
       "      <td>0.164286</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Konbu</td>\n",
       "      <td>[Ana Trujillo Emparedados y helados]</td>\n",
       "      <td>0.158730</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Mascarpone Fabioli</td>\n",
       "      <td>[Ana Trujillo Emparedados y helados]</td>\n",
       "      <td>0.158730</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Camembert Pierrot</td>\n",
       "      <td>[Ana Trujillo Emparedados y helados]</td>\n",
       "      <td>0.158730</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mozzarella di Giovanni</td>\n",
       "      <td>[Ana Trujillo Emparedados y helados]</td>\n",
       "      <td>0.158730</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              p.prod_name                             customers  \\\n",
       "0  Escargots de Bourgogne                 [Alfreds Futterkiste]   \n",
       "1       Gorgonzola Telino                     [Around the Horn]   \n",
       "2     Sir Rodney's Scones             [Blauer See Delikatessen]   \n",
       "3                   Konbu  [Ana Trujillo Emparedados y helados]   \n",
       "4      Mascarpone Fabioli  [Ana Trujillo Emparedados y helados]   \n",
       "5       Camembert Pierrot  [Ana Trujillo Emparedados y helados]   \n",
       "6  Mozzarella di Giovanni  [Ana Trujillo Emparedados y helados]   \n",
       "\n",
       "   recommendation  \n",
       "0        0.229885  \n",
       "1        0.176923  \n",
       "2        0.164286  \n",
       "3        0.158730  \n",
       "4        0.158730  \n",
       "5        0.158730  \n",
       "6        0.158730  "
      ]
     },
     "execution_count": 263,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"WITH 1 as neighbours\n",
    "MATCH (me:customer)-[:similarity]->(c:customer)-[r:rated]->(p:product)\n",
    "WHERE NOT ( (me)-[:rated]->(p:Product) )\n",
    "WITH  p, COLLECT(r.rating)[0..neighbours] as ratings, collect(c.customer_name)[0..neighbours] as customers\n",
    "WITH  p, customers, REDUCE(s=0,i in ratings | s+i) / SIZE(ratings)  as recommendation\n",
    "WHERE recommendation > .15 AND recommendation < .3\n",
    "RETURN p.prod_name, customers, recommendation \n",
    "ORDER BY recommendation DESC\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 221,
   "id": "d2cc014b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.prod_name</th>\n",
       "      <th>customers</th>\n",
       "      <th>recommendation</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Louisiana Fiery Hot Pepper Sauce</td>\n",
       "      <td>[Furia Bacalhau e Frutos do Mar]</td>\n",
       "      <td>0.157593</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Chartreuse verte</td>\n",
       "      <td>[Familia Arquibaldo]</td>\n",
       "      <td>0.140056</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Uncle Bob's Organic Dried Pears</td>\n",
       "      <td>[Reggiani Caseifici]</td>\n",
       "      <td>0.119403</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Sir Rodney's Marmalade</td>\n",
       "      <td>[Océano Atlántico Ltda.]</td>\n",
       "      <td>0.113636</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Maxilaku</td>\n",
       "      <td>[Comércio Mineiro]</td>\n",
       "      <td>0.112782</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>Genen Shouyu</td>\n",
       "      <td>[Save-a-lot Markets]</td>\n",
       "      <td>0.010085</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>Ipoh Coffee</td>\n",
       "      <td>[Furia Bacalhau e Frutos do Mar]</td>\n",
       "      <td>0.008596</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Laughing Lumberjack Lager</td>\n",
       "      <td>[Lehmanns Marktstand]</td>\n",
       "      <td>0.006297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>Ravioli Angelo</td>\n",
       "      <td>[Save-a-lot Markets]</td>\n",
       "      <td>0.003025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>Gula Malacca</td>\n",
       "      <td>[White Clover Markets]</td>\n",
       "      <td>0.001881</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>67 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                         p.prod_name                         customers  \\\n",
       "0   Louisiana Fiery Hot Pepper Sauce  [Furia Bacalhau e Frutos do Mar]   \n",
       "1                   Chartreuse verte              [Familia Arquibaldo]   \n",
       "2    Uncle Bob's Organic Dried Pears              [Reggiani Caseifici]   \n",
       "3             Sir Rodney's Marmalade          [Océano Atlántico Ltda.]   \n",
       "4                           Maxilaku                [Comércio Mineiro]   \n",
       "..                               ...                               ...   \n",
       "62                      Genen Shouyu              [Save-a-lot Markets]   \n",
       "63                       Ipoh Coffee  [Furia Bacalhau e Frutos do Mar]   \n",
       "64         Laughing Lumberjack Lager             [Lehmanns Marktstand]   \n",
       "65                    Ravioli Angelo              [Save-a-lot Markets]   \n",
       "66                      Gula Malacca            [White Clover Markets]   \n",
       "\n",
       "    recommendation  \n",
       "0         0.157593  \n",
       "1         0.140056  \n",
       "2         0.119403  \n",
       "3         0.113636  \n",
       "4         0.112782  \n",
       "..             ...  \n",
       "62        0.010085  \n",
       "63        0.008596  \n",
       "64        0.006297  \n",
       "65        0.003025  \n",
       "66        0.001881  \n",
       "\n",
       "[67 rows x 3 columns]"
      ]
     },
     "execution_count": 221,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"WITH 1 as neighbours\n",
    "MATCH (me:customer)-[:similarity]->(c:customer)-[r:rated]->(p:product)\n",
    "WHERE NOT ( (me)-[:rated]->(p:Product) )\n",
    "WITH  p, COLLECT(r.rating)[0..neighbours] as ratings, collect(c.customer_name)[0..neighbours] as customers\n",
    "WITH  p, customers, REDUCE(s=0,i in ratings | s+i) / SIZE(ratings)  as recommendation\n",
    "WHERE recommendation > .15 AND recommendation < .3\n",
    "RETURN p.prod_name, customers, recommendation \n",
    "ORDER BY recommendation DESC\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 264,
   "id": "8538e53f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>original_product</th>\n",
       "      <th>recommendation</th>\n",
       "      <th>customers_also_bought_n_times</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Raclette Courdavault</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Boston Crab Meat</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  original_product        recommendation  customers_also_bought_n_times\n",
       "0    Aniseed Syrup  Raclette Courdavault                              9\n",
       "1    Aniseed Syrup      Boston Crab Meat                              8"
      ]
     },
     "execution_count": 264,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"MATCH (p1:product {prod_id: \"prod_3\"})<-[:rated]-(c:customer)-[:rated]->(p2:product)\n",
    "WITH   p1.prod_name AS original_product, \n",
    "       p2.prod_name AS recommendation, \n",
    "       COUNT(*) AS customers_also_bought_n_times\n",
    "WHERE  customers_also_bought_n_times > 7\n",
    "RETURN original_product, recommendation, customers_also_bought_n_times\n",
    "ORDER BY customers_also_bought_n_times DESC \"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8b982dd1",
   "metadata": {},
   "source": [
    "# Customers who bought Aniseed Syrup , also bought that other products more then 5 times."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 266,
   "id": "948ad28e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>original_product</th>\n",
       "      <th>recommendation</th>\n",
       "      <th>customers_also_bought_n_times</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Raclette Courdavault</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Boston Crab Meat</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Mozzarella di Giovanni</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Tarte au sucre</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Pâté chinois</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Chartreuse verte</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Uncle Bob's Organic Dried Pears</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Ipoh Coffee</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Camembert Pierrot</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Jack's New England Clam Chowder</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Flotemysost</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Lakkalikööri</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Ikura</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Konbu</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Pavlova</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Steeleye Stout</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Aniseed Syrup</td>\n",
       "      <td>Outback Lager</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   original_product                   recommendation  \\\n",
       "0     Aniseed Syrup             Raclette Courdavault   \n",
       "1     Aniseed Syrup                 Boston Crab Meat   \n",
       "2     Aniseed Syrup           Mozzarella di Giovanni   \n",
       "3     Aniseed Syrup                   Tarte au sucre   \n",
       "4     Aniseed Syrup                     Pâté chinois   \n",
       "5     Aniseed Syrup                 Chartreuse verte   \n",
       "6     Aniseed Syrup  Uncle Bob's Organic Dried Pears   \n",
       "7     Aniseed Syrup                      Ipoh Coffee   \n",
       "8     Aniseed Syrup                Camembert Pierrot   \n",
       "9     Aniseed Syrup  Jack's New England Clam Chowder   \n",
       "10    Aniseed Syrup                      Flotemysost   \n",
       "11    Aniseed Syrup                     Lakkalikööri   \n",
       "12    Aniseed Syrup                            Ikura   \n",
       "13    Aniseed Syrup                            Konbu   \n",
       "14    Aniseed Syrup                          Pavlova   \n",
       "15    Aniseed Syrup                   Steeleye Stout   \n",
       "16    Aniseed Syrup                    Outback Lager   \n",
       "\n",
       "    customers_also_bought_n_times  \n",
       "0                               9  \n",
       "1                               8  \n",
       "2                               7  \n",
       "3                               7  \n",
       "4                               7  \n",
       "5                               7  \n",
       "6                               6  \n",
       "7                               6  \n",
       "8                               6  \n",
       "9                               6  \n",
       "10                              6  \n",
       "11                              6  \n",
       "12                              6  \n",
       "13                              6  \n",
       "14                              6  \n",
       "15                              6  \n",
       "16                              6  "
      ]
     },
     "execution_count": 266,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p1:product {prod_id: \"prod_3\"})<-[:rated]-(c:customer)-[:rated]->(p2:product)\n",
    "WITH   p1.prod_name AS original_product, \n",
    "       p2.prod_name AS recommendation, \n",
    "       COUNT(*) AS customers_also_bought_n_times\n",
    "WHERE  customers_also_bought_n_times > 5\n",
    "RETURN original_product, recommendation, customers_also_bought_n_times\n",
    "ORDER BY customers_also_bought_n_times DESC \n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1db19938",
   "metadata": {},
   "source": [
    "# Rating count for each product"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 267,
   "id": "911277a4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>product_name</th>\n",
       "      <th>rating_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Raclette Courdavault</td>\n",
       "      <td>43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Camembert Pierrot</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Gorgonzola Telino</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Jack's New England Clam Chowder</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Gnocchi di nonna Alice</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>Valkoinen suklaa</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>Louisiana Hot Spiced Okra</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Genen Shouyu</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>Chocolade</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>67 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       product_name  rating_count\n",
       "0              Raclette Courdavault            43\n",
       "1                 Camembert Pierrot            36\n",
       "2                 Gorgonzola Telino            34\n",
       "3   Jack's New England Clam Chowder            34\n",
       "4            Gnocchi di nonna Alice            34\n",
       "..                              ...           ...\n",
       "62                 Valkoinen suklaa             9\n",
       "63        Louisiana Hot Spiced Okra             8\n",
       "64                     Genen Shouyu             6\n",
       "65                       Gravad lax             6\n",
       "66                        Chocolade             6\n",
       "\n",
       "[67 rows x 2 columns]"
      ]
     },
     "execution_count": 267,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:product)<-[:rated]-(c:customer)\n",
    "WITH p.prod_name AS product_name, COUNT(*) AS rating_count\n",
    "RETURN product_name, rating_count\n",
    "ORDER BY rating_count DESC\n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b8ceac26",
   "metadata": {},
   "source": [
    "# Category wise top rated products"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 268,
   "id": "e77fc452",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category_name</th>\n",
       "      <th>product_name</th>\n",
       "      <th>rating_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>Lakkalikööri</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>Outback Lager</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>Steeleye Stout</td>\n",
       "      <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>Ipoh Coffee</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>Carnarvon Tigers</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>Escargots de Bourgogne</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>Rogede sild</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>Röd Kaviar</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>67 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   category_name            product_name  rating_count\n",
       "0      Beverages            Lakkalikööri            33\n",
       "1      Beverages    Rhönbräu Klosterbier            33\n",
       "2      Beverages           Outback Lager            30\n",
       "3      Beverages          Steeleye Stout            28\n",
       "4      Beverages             Ipoh Coffee            26\n",
       "..           ...                     ...           ...\n",
       "62       Seafood        Carnarvon Tigers            22\n",
       "63       Seafood  Escargots de Bourgogne            17\n",
       "64       Seafood             Rogede sild            12\n",
       "65       Seafood              Röd Kaviar            11\n",
       "66       Seafood              Gravad lax             6\n",
       "\n",
       "[67 rows x 3 columns]"
      ]
     },
     "execution_count": 268,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (cat:ctg)<-[:part_of]-(p:product)<-[r:rated]-(c:customer)\n",
    "WITH   cat.ctg_name AS category_name,\n",
    "       p.prod_name AS product_name, \n",
    "       COUNT(*) AS rating_count\n",
    "RETURN   category_name,\n",
    "         product_name, \n",
    "         rating_count\n",
    "ORDER BY category_name, \n",
    "         rating_count DESC\n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d905774d",
   "metadata": {},
   "source": [
    "# Creating prod_rating nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 269,
   "id": "0ecf77f0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3245\n",
      "  Relationships: 10033\n",
      "-------------------------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category_name</th>\n",
       "      <th>category_id</th>\n",
       "      <th>product_name</th>\n",
       "      <th>product_id</th>\n",
       "      <th>rating_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>ctg_1</td>\n",
       "      <td>Lakkalikööri</td>\n",
       "      <td>prod_76</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>ctg_1</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "      <td>prod_75</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>ctg_1</td>\n",
       "      <td>Outback Lager</td>\n",
       "      <td>prod_70</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>ctg_1</td>\n",
       "      <td>Steeleye Stout</td>\n",
       "      <td>prod_35</td>\n",
       "      <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Beverages</td>\n",
       "      <td>ctg_1</td>\n",
       "      <td>Ipoh Coffee</td>\n",
       "      <td>prod_43</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>ctg_8</td>\n",
       "      <td>Carnarvon Tigers</td>\n",
       "      <td>prod_18</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>ctg_8</td>\n",
       "      <td>Escargots de Bourgogne</td>\n",
       "      <td>prod_58</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>ctg_8</td>\n",
       "      <td>Rogede sild</td>\n",
       "      <td>prod_45</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>ctg_8</td>\n",
       "      <td>Röd Kaviar</td>\n",
       "      <td>prod_73</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>Seafood</td>\n",
       "      <td>ctg_8</td>\n",
       "      <td>Gravad lax</td>\n",
       "      <td>prod_37</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>67 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   category_name category_id            product_name product_id  rating_count\n",
       "0      Beverages       ctg_1            Lakkalikööri    prod_76            33\n",
       "1      Beverages       ctg_1    Rhönbräu Klosterbier    prod_75            33\n",
       "2      Beverages       ctg_1           Outback Lager    prod_70            30\n",
       "3      Beverages       ctg_1          Steeleye Stout    prod_35            28\n",
       "4      Beverages       ctg_1             Ipoh Coffee    prod_43            26\n",
       "..           ...         ...                     ...        ...           ...\n",
       "62       Seafood       ctg_8        Carnarvon Tigers    prod_18            22\n",
       "63       Seafood       ctg_8  Escargots de Bourgogne    prod_58            17\n",
       "64       Seafood       ctg_8             Rogede sild    prod_45            12\n",
       "65       Seafood       ctg_8              Röd Kaviar    prod_73            11\n",
       "66       Seafood       ctg_8              Gravad lax    prod_37             6\n",
       "\n",
       "[67 rows x 5 columns]"
      ]
     },
     "execution_count": 269,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (cat:ctg)<-[:part_of]-(p:product)<-[r:rated]-(c:customer)\n",
    "WITH   cat.ctg_name AS category_name,\n",
    "       cat.ctg_id   AS category_id,\n",
    "       p.prod_name  AS product_name,\n",
    "       p.prod_id    AS product_id,\n",
    "       COUNT(*) AS rating_count\n",
    "RETURN   category_name,\n",
    "         category_id,\n",
    "         product_name, \n",
    "         product_id,\n",
    "         rating_count\n",
    "ORDER BY category_name, \n",
    "         rating_count DESC\n",
    "\"\"\"\n",
    "ctg_top_rated_prod_df = n4j_helper.neo4j_run_query_pandas(query)\n",
    "\n",
    "for ctg_prod in ctg_top_rated_prod_df.values.tolist():\n",
    "    ctg_id = ctg_prod[1]\n",
    "    prod_id = ctg_prod[3]\n",
    "    rating_count = ctg_prod[-1]\n",
    "    label_name    = 'prod_rating'\n",
    "    label_value   = prod_id\n",
    "    label_details = f\"{label_value}:{label_name}\"\n",
    "    node_property_string = '{prod_id: \"' + prod_id + '\", ctg_id: \"' + ctg_id + '\", rating_count: ' + str(rating_count) + '}'\n",
    "    n4j_helper.neo4j_create_node(label_details   = label_details\n",
    "                               , node_property   = node_property_string)\n",
    "n4j_helper.neo4j_number_nodes_relationships()\n",
    "\n",
    "ctg_top_rated_prod_df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f067aab5",
   "metadata": {},
   "source": [
    "# Create relationship between product and prod_rating\n",
    "\n",
    "# (prod)-[:has_number_of]->(prod_rating)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 270,
   "id": "b6c03228",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 3245\n",
      "  Relationships: 10033\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (p:product),(pr:prod_rating)\n",
    "WHERE      p.prod_id = pr.prod_id\n",
    "AND        p.ctg_id  = pr.ctg_id\n",
    "MERGE      (p)-[:has_number_of]->(pr)\"\"\"\n",
    "n4j_helper.neo4j_session.run(query)\n",
    "n4j_helper.neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "94759c32",
   "metadata": {},
   "source": [
    "# Suggesting customers other top rated products in the same category which they have not bought\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 271,
   "id": "9033e938",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>customer_name</th>\n",
       "      <th>category_name</th>\n",
       "      <th>recommended_product</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Chartreuse verte</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Côte de Blaye</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Ipoh Coffee</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Lakkalikööri</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Outback Lager</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Rhönbräu Klosterbier</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Sasquatch Ale</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Around the Horn</td>\n",
       "      <td>Beverages</td>\n",
       "      <td>Steeleye Stout</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     customer_name category_name   recommended_product\n",
       "0  Around the Horn     Beverages      Chartreuse verte\n",
       "1  Around the Horn     Beverages         Côte de Blaye\n",
       "2  Around the Horn     Beverages           Ipoh Coffee\n",
       "3  Around the Horn     Beverages          Lakkalikööri\n",
       "4  Around the Horn     Beverages         Outback Lager\n",
       "5  Around the Horn     Beverages  Rhönbräu Klosterbier\n",
       "6  Around the Horn     Beverages         Sasquatch Ale\n",
       "7  Around the Horn     Beverages        Steeleye Stout"
      ]
     },
     "execution_count": 271,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"MATCH (cust1:customer)-[r1:rated]->(p1:product)-[:part_of]->(cat:ctg)\n",
    "MATCH (p2)-[:part_of]->(cat)\n",
    "MATCH (p1)-[prt1:has_number_of]->(pr1:prod_rating)\n",
    "MATCH (p2)-[prt2:has_number_of]->(pr2:prod_rating)\n",
    "WHERE  NOT EXISTS ((cust1)-[r1:rated]->(p2))\n",
    "AND    pr2.rating_count > pr1.rating_count\n",
    "AND    cust1.customer_name = 'Around the Horn'\n",
    "AND    cat.ctg_name        = \"Beverages\"\n",
    "RETURN \n",
    "DISTINCT cust1.customer_name          AS customer_name\n",
    "       , cat.ctg_name                 AS category_name              \n",
    "       , p2.prod_name                 AS recommended_product\n",
    "ORDER BY customer_name\n",
    "       , category_name\n",
    "       , recommended_product\n",
    "\"\"\"\n",
    "n4j_helper.neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c6b00d96",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "74827ab2",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
